[
    {
      "Date": "10-1932",
      "English": "Father Hugh Sharkey recalled from Chekiang, China, to found a mission for the Chinese people of Vancouver.",
      "Chinese": "斯加波羅外方傳教會之 Hugh Sharkey 神父由我國浙江省奉召到溫哥華創辦一華人堂區。",
      "photos":[]
    },
    {
      "Date": "12-1933",
      "English": "Mission officially opened with Mass offered by Archbishop William Mark Duke in the small house.",
      "Chinese": "堂區正式開幕，由William Mark Duke 總主教舉行第一台彌撒聖祭。",
      "photos":[]
    },
    {
      "Date": "12-1933",
      "English": "Formal opening of the Mission's Kindergarten. Rose Mary Wong was the first student to register.",
      "Chinese": "堂區附設之幼稚園成立並開始招收學生，第一個報名之學生爲Rose Mary Wong。",
      "photos":[]
    },
    {
      "Date": "09-1934",
      "English": "First group baptized. Thirteen in all.",
      "Chinese": "第一次集體領冼，人數為十三人。",
      "photos":[]
    },
    {
      "Date": "09-1938",
      "English": "Sister Hilda (Principal), Sister Mary Philip and Sister Francis Regis arrived to staff the St. Francis Xavier School. The initial enrollment for this unique school was 55.",
      "Chinese": "Hilda (後被委為校長), Mary Philip 與 Francis 和 Riges修女抵達堂區協助小學事宜。首期學生為五十五人。",
      "photos":["19380903.png"]
    },
    {
      "Date": "08-1939",
      "English": "The building on E. Georgia that was purchased in 1938 by Father Turner was moved to the lot behind the convent. After renovation, it became our Chapel.",
      "Chinese": "於 1938 年購下位於 ( E. Georgia)  佐冶東街之物業，其上蓋被移往修女宿舍後之空地， 於裝修後， 成爲堂區之新聖堂。",
      "photos":[]
    },
    {
      "Date": "10-1963",
      "English": "Father Chow established the parish Council. ",
      "Chinese": "周神父成立本堂諮議會。",
      "photos":[]
    },
    {
      "Date": "12-1964",
      "English": "The Christmas Midnight Mass was offered for the first time in Chinese.",
      "Chinese": "首次以中文舉行子夜彌撒。",
      "photos":[]
    },
    {
      "Date": "01-1969",
      "English": "Father Chow organized a club for elderly ladies - the Blessed Sacrament Club. One of their main work was to take care of the altar linens and the Church.",
      "Chinese": "周神父為年長婦女教友粗織一名爲聖體會之善會，主要任務之一為負責祭台布與清理聖堂。",
      "photos":["196901.png"]
    },
    {
      "Date": "01-1975",
      "English": "Departure Day for a dearly beloved Pastor, Father Chow. The 9:30am Mass was crowded to the doors and beyond. Fathers Aloysius Lou, the incoming Pastor and Father Chafe S.F.M., the previous Pastor were the Co-celebrants with the out-going Pastor at the\nHigh Mass, Father Chow's final Mass as Pastor of St. Francis. After the final blessing, Father A. Lou handed him the Keys of St. Francis Xavier Parish.\nImmediately following the morning Mass, Father Chow left for the airport. He was not alone - a great throng of parishioners followed him and remained at the airport until the plane carrying Father Chow, was out of sight.\nFather Aloysius Lou became our Pastor today - the second Chinese Pastor of St. Francis Xavier Parish.",
      "Chinese": "周神父以本堂神父身份作最後一台彌撒，並由前任本堂神父Chafe 與即將接任之盧神父襄祭，到場教友甚為擠擁，最後周神父降褔盧神父並將聖堂鎖匙交與盧神父。彌撒後隨即前往機場，全體敎友尾隨而至，均面露依依不捨之情，待神父乘搭之飛機遠去方各自回家。盧湛明神父正式上任爲本堂神父。",
      "photos":[]
    },
    {
      "Date": "09-1979",
      "English": "As a community, St. Francis Xavier Parish sponsored 30 vietnamese refugees to resettle in Canada.",
      "Chinese": "聖堂以團體名義向政府担保卅名越南教友來加定居。",
      "photos":[]
    },
    {
      "Date": "05-1981",
      "English": "Another first - A Walkathon.\nWhat began as a plan to raise funds for school supplies turned out to be a happy full-blown-parish affair. Parents, friends and their friends joined the school-children on the five-mile walk around Stanley Park.",
      "Chinese": "為學校籌款而舉辦之百萬行第一次舉行。沿士丹尼公園海邊而行，路程約為五哩。",
      "photos":[]
    }
   ]